# GetHLLineStyle

## Description
Gets the Line Style of the specified Hidden Line Rendering options handle.

```pascal
PROCEDURE GetHLLineStyle(
				HLOptionsHandle : HANDLE;
				VAR lineStyle   : INTEGER);
```

```python

def vs.GetHLLineStyle(HLOptionsHandle):
    return lineStyle
```

## Parameters
|Name|Type|Description|
|---|---|---|
|HLOptionsHandle|HANDLE||
|lineStyle|INTEGER||

## Version
Availability: from Vectorworks 2019
## Category
* View / Zoom